{
  "STULZ": [
    {
      "name": "Ritik Mehrotra",
      "batch": "B.E. Electronics Engg.",
      "img": "/Assets/Contributions/Testimonials/Ritik-Mehrotra.webp",
      "text": "I am thankful to the Stulz Scholarship and I wish that in thefuture I will be able to stand in such a situation to pay thischance forward to another individual and make a variety instudents’ existences."
    },
    {
      "name": "Suryansh Purohit",
      "batch": "B.E. Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Suryansh-Purohit.webp",
      "text": "I would like to thank you for your generosity as I am sincerely honored to be one of the recipients of this scholarship provided by STULZ-CHSPL FOUNDATION. Receiving this scholarship motivates me to maintain my grades and complete my graduation. I really appreciate your assistance and cannot express my gratitude enough for your continued support for my academic endeavors, Thank you again."
    },
    {
      "name": "Rahul Pujari",
      "batch": "B.E. IT Engg.",
      "img": "/Assets/Contributions/Testimonials/Rahul-Pujari.webp",
      "text": "I am a final year student of fr.crce 2022 batch and a proud recipient of stulz scholarship. The amount I had received helped me a lot in my education. During these tough covid times, it's a great relief for any student and their parents when we can study without thinking about the financial problem. Thank you so much to all members of the Stulz Foundation and the Alumni Association of CRCE."
    },
    {
      "name": "Ashally Simon Tuscano",
      "batch": "B.E. IT Engg.",
      "img": "/Assets/Contributions/Testimonials/Ashally-Tuscano.webp",
      "text": "I am sincerely honored to have been selected as one of the recipients of the Stulz Foundation scholarship. Thank you for your generosity, which has allowed me to pay my college fees. As I complete my education, I am very thankful for receiving your thoughtful gift. All this could be possible because of the Alumni Committee and Stulz Foundation. Thanking all the members, once again for making this a smooth process and giving students like me a great opportunity."
    },
    {
      "name": "Akash Jadhav",
      "batch": "B.E. Production Engg.",
      "img": "/Assets/Contributions/Testimonials/Akash-Jadhav.webp",
      "text": "I am honored to be one of the recipients of the stulz Foundation Scholarship. Thanks to your generous support."
    },
    {
      "name": "Ganesh Reddy",
      "batch": "B.E. Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Ganesh-Reddy.webp",
      "text": "I would like to thank you for your generosity as I am sincerely honored to be one of the recipients of this scholarship provided by STULZ-CHSPL FOUNDATION. Receiving this scholarship reduces a lot of burden on my family which in return motivates me to maintain my grades and complete my degree. I really appreciate your assistance and cannot express my gratitude enough for your continued support of my academic endeavors, Thank you again."
    },
    {
      "name": "Sanath Shetty",
      "batch": "B.E. Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Sanath-Shetty.webp",
      "text": "I would like to thank you for your generosity as I am sincerely honored to be one of the recipients of this scholarship provided by STULZ-CHSPL FOUNDATION. This scholarship came as a blessing to me which will help me to continue my studies and get closer to my dreams. I really appreciate your assistance and cannot express my gratitude enough for your continued support of my academic endeavors, Thank you again."
    },
    {
      "name": "Amit Dubey",
      "batch": "B.E. Production Engg.",
      "img": "/Assets/Contributions/Testimonials/Amit-Dubey.webp",
      "text": "I would like to take this opportunity to thank each and every one of you who in some way contributed to make it possible for me to receive this scholarship. I will forever be grateful to you for the scholarships that you have provided to not just me but all the students in need for the past so many years, because as I know how it has changed my life it has certainly changed the lives of many more scholars. This experience that I had as a scholar has brought a sense of maturity and made me believe in the saying “ The best gift you can give someone is to educate them ”. I will take this experience ahead in my life and will keep contributing to the education field in everything in my capacity."
    },
    {
      "name": "Vineet Solanki",
      "batch": "T.E. Mechanical Engg.",
      "img": "/Assets/Contributions/Testimonials/Vineet-Solanki.webp",
      "text": "Since the time I had applied for a scholarship at the Stulz Foundation, I was curious if I would get it. As soon as I came to know that I have received the scholarship amount, I was elated. On behalf of my entire family, I thank the Stulz Foundation for providing me Scholarship and helping me financially in my academics. I also thank the Alumni Committee of CRCE for bridging the gap between students like me and the Stulz foundation."
    },
    {
      "name": "Harsh Remje",
      "batch": "T.E. Mechanical Engg.",
      "img": "/Assets/Contributions/Testimonials/Harsh-Remje.webp",
      "text": "Thank you for giving me the scholarship and I am honored to have been selected as the recipient of the STULZ-CHSPL Foundation Scholarship. This scholarship has really lessened the burden on my family. It's been a great help, my parents are also thankful for your generosity. Thank you again for your thoughtful and generous gift."
    },
    {
      "name": "Anonymous",
      "batch": "T.E. ECS Engg.",
      "img": "/Assets/Contributions/Testimonials/Anonymous.webp",
      "text": "I am grateful for being selected as the recipient of the Stulz Foundation Scholarship. It has been of great help to me especially when I was at one of the lowest point at my life. It was like a ray of hope and taught me to help the ones in need so that they don't loose faith in the world. I would also like to thank the Stulz Foundation and our Alumni Mr. Suresh Balakrishnan, Production 1995, because of whom this was made possible."
    },
    {
      "name": "Shubham Gawri",
      "batch": "S.E. AI&DS Engg.",
      "img": "/Assets/Contributions/Testimonials/Shubham-Gawri.webp",
      "text": "I am truly grateful for the scholarship support I got. This scholarship allows me to focus more on my studies rather than worrying about my fee payment. Thank you for your wonderful support 'Stulz Foundation', I hope this generous work keeps continuing so that students like me always feel motivated."
    },
    {
      "name": "Meet Parmar",
      "batch": "S.E. Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Meet-Parmar.webp",
      "text": "I am sincerely honored to receive a Scholarship from the Stulz Foundation. Thank you for your generosity, which helped me to clear pending fees. Without this scholarship, students such as myself would be unable to pursue Engineering. I am very thankful for your support."
    },
    {
      "name": "Bishnu Shrestha",
      "batch": "S.E. Mechanical Engg.",
      "img": "/Assets/Contributions/Testimonials/Bishnu-Shrestha.webp",
      "text": "I am writing to express my sincere and genuine gratitude and appreciation to you for sponsoring my studies and making the Stulz scholarship possible. Your scholarship is priceless and will definitely help me in my educational endeavors. Words can’t possibly measure the happiness I felt when I was informed that I’m chosen and sponsored by you to receive this scholarship. I am grateful for this opportunity to prove myself. It beyond doubt means a lot to me. Thank you once again for your bounteousness, assistance and for having faith in me. I guarantee you that I will make use of this opportunity to study really hard, achieve my goals and be a successful person in life. You have inspired me a lot and your kind favor also motivates me to help others in need and will definitely do so in the future."
    }
  ],
  "MilindMehere": [
    {
      "name": "Anonymous",
      "batch": "F.E. 'C' Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Anonymous.webp",
      "text": "I am a student from FE-C, writing this to express my sincere gratitude to Alumni Association Fr. CRCE and special thanks to Mr. Milind Mehere for making the Alumni Scholarship possible. I was thrilled to learn of my selection for this honor, and I am deeply appreciative of your support. It will help me to manage my financial hardships and provide me an opportunity to excel in my career ahead."
    },
    {
      "name": "Dhruv Mayekar",
      "batch": "F.E. 'D' Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Dhruv-Mayekar.webp",
      "text": "Hello I am Dhruv Mayekar, a FE, branch Computer Engineering. I'm very grateful to Mr. Milind Mehere sir and the Alumni Association for the help which was very much needed. The financial assistance you provided will help me worry less about finance and pay more attention to my education. Thank you again for your generosity and support. I promise you I will work very hard and eventually give back to others, both as a teacher and possibly a scholarship to future students like myself."
    },
    {
      "name": "Kartik Khade",
      "batch": "F.E. 'D' ECS Engg.",
      "img": "/Assets/Contributions/Testimonials/Anonymous.webp",
      "text": "I am very much thankful to Mr. Milind Mehere for the help which was very much needed. I am very much glad for the support. The financial assistance you provided will be of great help to me in paying my educational expenses. Thank you again for your generosity and support. I promise you I will work very hard, make my education worthy and eventually help others. Thanks a lot."
    },
    {
      "name": "Rahul Gandla",
      "batch": "F.E. Computer Engg.",
      "img": "/Assets/Contributions/Testimonials/Rahul-Gandla.webp",
      "text": "I couldn't be happier listening to this news. I'm really grateful to the Alumni Association and special thanks to Mr. Milind Mehere. I would try my best, making the money worth by working hard. I would like to Thank each and every person who helped me get this scholarship."
    }
  ]
}
